/* REXX */
/* THIS PROGRAM TAKES A NUMBER AND CONVERTS IT TO BINARY.
   FILE: C332114.REXX(DECTOBIN)
   AUTHOR: JAMES HUND
   VERSION: 03/28/18
*/
CLRSCRN
PARSE UPPER ARG A
SAY 'ENTER A POSITIVE NUMBER'
PULL N

IF DATATYPE(A) = 'NUM' THEN
   N = A
ST=''
DO WHILE N > 0
   ST = ST ||(N//2)
   N = N % 2
END
SAY 'BINARY REPRESENTATION IS ' || REVERSE(ST)
EXIT