//COBOL2 JOB 1,'JAMES HUND',NOTIFY=&SYSUID
//**************************************************
//* COMPILE LINK AND GO FOR A SIMPLE COBOL PROGRAM
//**************************************************
//STEP1 EXEC IGYWCLG,TIME=1
//COBOL.SYSIN DD DSN=&SYSUID..TEMP(COBOL2),DISP=SHR
//* CHANGE INPUT AND OUTPUT DATASET NA
//GO.OUTPUT DD DSN=&SYSUID..TEMP(OUT2),DISP=SHR
//GO.INPUT DD DSN=&SYSUID..TEMP(IN2),DISP=SHR