//COBOL4 JOB 1,'JAMES HUND',NOTIFY=&SYSUID
//**************************************************
//* COMPILE LINK AND GO FOR A SIMPLE COBOL PROGRAM
//**************************************************
//STEP1 EXEC IGYWCLG,TIME=1
//COBOL.SYSIN DD DSN=&SYSUID..TEMP(COBOL4),DISP=SHR
//GO.SYSIN DD *
0025000000
499
030