//C332114E JOB 1,'YOUR NAME',NOTIFY=&SYSUID
//* REXX PROGRAM TO BE EXECUTED
//STEP1 EXEC PGM=IRXJCL,PARM='EXAM2',TIME=1
//* DD FOR INPUT WHICH IS INSTREAM
//SYSTSIN DD *
COMMITTEE
KNOWLEDGEABLE
DESIGNATIONAL
SUBSPECIALITY
UNASSAILABLE
SMILE
WOODCUTTING
SUPERINTENDENT
INFURIATING
BEWILDERING
//* DD FOR OUTPUT TO THE DEFAULT OUTSTREAM
//SYSTSPRT DD SYSOUT=*
//* DD THAT SPECIFIES THE PDS CONTAINING YOUR REXX PROGRAM
//SYSEXEC DD DSN=&SYSUID..REXX,DISP=SHR