//C332114E JOB 1,'YOUR NAME',NOTIFY=&SYSUID
//* REXX PROGRAM TO BE EXECUTED
//STEP1 EXEC PGM=IRXJCL,PARM='PROFILEX',TIME=1
//* DD FOR INPUT WHICH IS INSTREAM
//SYSTSIN DD *
//* DD FOR OUTPUT TO THE DEFAULT OUTSTREAM
//SYSTSPRT DD SYSOUT=*
//* DD THAT SPECIFIES THE PDS CONTAINING YOUR REXX PROGRAM
//SYSEXEC DD DSN=&SYSUID..REXX,DISP=SHR