//C332114R JOB 1,'JAMES HUND',NOTIFY=&SYSUID
//* REXX PROGRAM TO BE EXECUTED
//STEP1 EXEC PGM=IRXJCL,PARM='RANDEXX',TIME=1
//* DD FOR DATASET INPUT
//SYSTSIN DD *
//* DD FOR DATASET OUTPUT
//SYSTSPRT DD SYSOUT=*
//* DD THAT SPECIFIES PDS CONTAINING YOUR REXX PROGRAM
//SYSEXEC DD DSN=&SYSUID..REXX,DISP=SHR